app/controllers/posts_controller.rb

  def show
     @post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 11], ["id", nil], ["LIMIT", 1]]